app/Controllers/Home.php

INSERT INTO `tb_push_notif` (`id_user`, `tipe_user`, `endpoint`, `p256dh`, `auth`) VALUES ('1', 'pelapor', 'https://fcm.googleapis.com/fcm/send/csOJXp0Z_wU:APA91bECvQYrtSOt_6no13G7ICoF-NT-U4lVk_1km7xK8RZOADcEPD2eUj3NtMK0VqW8_fwRR5ANqdva24PA3nxdTuJI74YPNttfpKWm-11nUTWdjx6I1dKOpl2hjnmITXTkb8rZIj8X', 'BMkxKE0tKHRWc/v4zLXW4d0/rA/3raYYFsiHplt44nnFg6Xqw1DFbhzztbF0hCNJ+mkyVoX6zw1hFIS8EIs3iPU=', 'Peh5I5Gee56xKf6gGD0itw==')
---
    public function push_subscription()
    {
        $id_user = $this->request->getPost('id_user');
        $tipe_user = $this->request->getPost('tipe_user');
        $endpoint = $this->request->getPost('endpoint');
        $p256dh = $this->request->getPost('p256dh');
        $auth = $this->request->getPost('auth');

        $cek_data = $this->db->query("SELECT * FROM tb_push_notif WHERE id_user='$id_user' AND tipe_user='$tipe_user' AND endpoint = '$endpoint'");
        if ($cek_data->getNumRows() == 0) {
            $this->PushNotifModel->save([
                'id_user' => $id_user,
                'tipe_user' => $tipe_user,
                'endpoint' => $endpoint,
                'p256dh' => $p256dh,
                'auth' => $auth
            ]);