app/Controllers/Pelapor/Laporan.php

INSERT INTO `tb_laporan` (`waktu`, `token`, `id_pelapor`, `id_kategori_laporan`, `latitude`, `longitude`, `status`, `verifikasi`) VALUES ('2022-11-09 17:59:37', 'Bl03IUY15bGaGibv9K9NzVDEN42vHjBv0IHp7', '1', '1', '-0.0517121', '109.348117', '0', '0')
---
	public function create_laporan()
	{
		$tanggal_now = date("Y-m-d");
		$waktu_data = date("Y-m-d H:i:s");
		$id_kategori_laporan = $this->request->getPost('id_kategori_laporan');

		$id_pelapor = $this->user_id_pelapor;
		$latitude = $this->user_latitude;
		$longitude = $this->user_longitude;

		$cek_data = $this->db->query("SELECT * FROM tb_laporan WHERE id_pelapor='$id_pelapor' AND latitude='$latitude' AND longitude='$longitude' AND DATE(waktu) = '$tanggal_now' ");

		$class_login = new \App\Controllers\Pelapor\Login;
		$token = $class_login->getToken(37);

		if ($cek_data->getNumRows() == 0) {
			$this->LaporanModel->save([
				'token' => $token,
				'id_pelapor' => $id_pelapor,
				'id_kategori_laporan' => $id_kategori_laporan,
				'latitude' => $latitude,
				'longitude' => $longitude,
				'status' => '0',
				'verifikasi' => '0'
			]);