app/Models/LaporanModel.php

SELECT *
FROM `tb_laporan`
WHERE `id_pelapor` = '109122807979405606847'
ORDER BY `id_laporan` DESC
---
	public function getLaporanByIdPelapor($id_pelapor)
	{
		return $this->where([
			'id_pelapor' => $id_pelapor
		])->orderBy('id_laporan', 'desc')->findAll();