app/Models/PelaporModel.php

SELECT *
FROM `tb_pelapor`
WHERE `google_id` = '109122807979405606847'
 LIMIT 1
---
	public function getPelaporByGoogleId($google_id)
	{
		return $this->where(['google_id' => $google_id])->first();

UPDATE `tb_pelapor` SET `latitude` = '-0.0851968', `longitude` = '109.4057984'
WHERE `id_pelapor` = '1'
---
	public function updatePelapor($data, $id)
	{
		$query = $this->db->table($this->table)->update($data, array('id_pelapor' => $id));